
[
  {
    "name": "Spaghetti Carbonara",
    "category": "Italian",
    "image": "https://example.com/spaghetti_carbonara.jpg",
    "description": "Classic Italian pasta dish with creamy sauce, eggs, cheese, and pancetta. Cook pasta, mix with sauce, and serve with grated cheese."
  },
  {
    "name": "Chicken Tacos",
    "category": "Mexican",
    "image": "https://example.com/chicken_tacos.jpg",
    "description": "Tasty chicken tacos with grilled chicken, salsa, shredded lettuce, and cheese. Assemble in soft tortillas and enjoy!"
  },
  {
    "name": "Sushi Rolls",
    "category": "Japanese",
    "image": "https://example.com/sushi_rolls.jpg",
    "description": "Fresh and delicious sushi rolls with a variety of fillings including fish, vegetables, and rice. Dip in soy sauce and enjoy!"
  },
  {
    "name": "Burger",
    "category": "American",
    "image": "https://example.com/burger.jpg",
    "description": "Classic American burger with a juicy beef patty, cheese, lettuce, tomato, and special sauce. Serve with fries for a satisfying meal."
  },
  {
    "name": "Pad Thai",
    "category": "Thai",
    "image": "https://example.com/pad_thai.jpg",
    "description": "Traditional Thai stir-fried noodle dish with shrimp, tofu, peanuts, and tangy tamarind sauce. A must-try for Thai food lovers!"
  },
  {
    "name": "Margherita Pizza",
    "category": "Italian",
    "image": "https://example.com/margherita_pizza.jpg",
    "description": "Classic Italian pizza with a thin crust, tomato sauce, fresh mozzarella, basil, and olive oil. Bake until the cheese is bubbly and golden."
  },
  {
    "name": "Sushi Sashimi Platter",
    "category": "Japanese",
    "image": "https://example.com/sushi_sashimi.jpg",
    "description": "Elegant sushi sashimi platter with a variety of fresh fish slices, served with pickled ginger, wasabi, and soy sauce."
  },
  {
    "name": "Veggie Stir-Fry",
    "category": "Asian",
    "image": "https://example.com/veggie_stir_fry.jpg",
    "description": "Healthy and colorful vegetable stir-fry with a variety of fresh veggies, tofu, and a flavorful soy-based sauce. Serve over rice or noodles."
  },
  {
    "name": "Roast Chicken",
    "category": "Comfort Food",
    "image": "https://example.com/roast_chicken.jpg",
    "description": "Juicy and tender roast chicken with crispy skin, flavored with herbs and served with roasted vegetables. Perfect for a comforting dinner."
  },
  {
    "name": "Chocolate Brownies",
    "category": "Dessert",
    "image": "https://example.com/chocolate_brownies.jpg",
    "description": "Decadent chocolate brownies with a rich and fudgy texture. Serve with a scoop of vanilla ice cream for a delightful dessert."
  }
]
